In [1]:
import pandas as pd
import numpy as np
from pandas import Series,DataFrame

In [2]:
#concatenate

In [3]:
#numpy concatenate
arr1 = np.arange(9).reshape(3,3)
arr2 = np.arange(9).reshape(3,3)

In [4]:
np.concatenate([arr1,arr2])

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8],
       [0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

In [5]:
np.concatenate([arr1,arr2],axis=1)

array([[0, 1, 2, 0, 1, 2],
       [3, 4, 5, 3, 4, 5],
       [6, 7, 8, 6, 7, 8]])

In [9]:
#Series concatenate
s1 = Series([1,2,3],index=['A','B','C'])
s2 = Series([1,2],index=['X','Y'])

In [10]:
pd.concat([s1,s2])

A    1
B    2
C    3
X    1
Y    2
dtype: int64

In [11]:
pd.concat([s1,s2],axis=1)

F:\anaconda\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

     0    1
A  1.0  NaN
B  2.0  NaN
C  3.0  NaN
X  NaN  1.0
Y  NaN  2.0

In [13]:
#DateFrame concatenate
df1 = DataFrame(np.random.randn(4,3),columns=['X','Y','Z'])
df1

          X         Y         Z
0 -0.568471  1.878828 -1.019795
1 -0.404072 -1.181788 -0.861384
2  0.545189  0.537834  0.455475
3  0.275083 -0.211469  1.397111

In [14]:
df2= DataFrame(np.random.randn(3,3),columns=['X','Y','A'])
df2

          X         Y         A
0  0.421911  0.001707 -0.065753
1 -0.811904  1.372747 -1.069166
2 -0.743681 -0.478609  0.987190

In [15]:
pd.concat([df1,df2])

F:\anaconda\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

          A         X         Y         Z
0       NaN -0.568471  1.878828 -1.019795
1       NaN -0.404072 -1.181788 -0.861384
2       NaN  0.545189  0.537834  0.455475
3       NaN  0.275083 -0.211469  1.397111
0 -0.065753  0.421911  0.001707       NaN
1 -1.069166 -0.811904  1.372747       NaN
2  0.987190 -0.743681 -0.478609       NaN

In [16]:
#combine

In [25]:
s1 = Series([np.nan,2,np.nan,4],index=['a','b','c','d'])
s1

a    NaN
b    2.0
c    NaN
d    4.0
dtype: float64

In [26]:
s2 = Series([1,2,3,4],index=['a','b','c','d'])
s2

a    1
b    2
c    3
d    4
dtype: int64

In [27]:
s1.combine_first(s2)

a    1.0
b    2.0
c    3.0
d    4.0
dtype: float64

In [28]:
#DataFrame combine

In [31]:
df1 = DataFrame({
    'x':[1,np.nan,3,np.nan],
    'y':[5,np.nan,7,np.nan],
    'z':[9,np.nan,11,np.nan]
})
df1

     x    y     z
0  1.0  5.0   9.0
1  NaN  NaN   NaN
2  3.0  7.0  11.0
3  NaN  NaN   NaN

In [32]:
df2 = DataFrame({
    'z':[1,np.nan,3,np.nan],
    'a':[1,2,3,4],
})
df2

     z  a
0  1.0  1
1  NaN  2
2  3.0  3
3  NaN  4

In [33]:
df1.combine_first(df2)

     a    x    y     z
0  1.0  1.0  5.0   9.0
1  2.0  NaN  NaN   NaN
2  3.0  3.0  7.0  11.0
3  4.0  NaN  NaN   NaN